Repository: na9oooooooor/Islamic-Habits
Catalog: Islamic Habits/Localizable.xcstrings
Source language: en
Languages: ar, th

source: "The most beloved deeds to Allah are the most consistent, even if small."
ar: «أحبُّ الأعمال إلى الله أدومُها وإن قلَّت.»
th: การงานที่อัลลอฮ์ทรงรักมากที่สุด คือการงานที่ทำอย่างสม่ำเสมอ แม้จะเล็กน้อยก็ตาม

source: ABOUT
ar: حول التطبيق
th: เกี่ยวกับ

# about.feedback.text
source: Something missing or not working? Your feedback helps make مرآة better.
ar: هل هناك شيء ناقص أو لا يعمل؟ ملاحظاتك تساعد على تحسين مرآة.
th: มีอะไรขาดหรือไม่ทำงาน? ข้อเสนอแนะของคุณช่วยพัฒนา มรآة ให้ดีขึ้น

# about.feedback.title
source: FEEDBACK
ar: التغذية الراجعة
th: ข้อเสนอแนะ

# about.footer
source: Made with intention 🤍
ar: صُنع بنيّة 🤍
th: สร้างด้วยความตั้งใจ 🤍

# about.miraat
source: About مرآة
ar: حول مرآة
th: เกี่ยวกับ มรآة

# about.privacy.text
source: Everything you log stays on your device. No accounts. No tracking. No data leaves your phone.
ar: كل ما تسجّله يبقى على جهازك. لا حسابات. لا تتبع. لا بيانات تغادر هاتفك.
th: ทุกสิ่งที่บันทึกอยู่บนอุปกรณ์ของคุณ ไม่มีบัญชี ไม่มีการติดตาม ไม่มีข้อมูลออกจากโทรศัพท์

# about.privacy.title
source: PRIVACY
ar: الخصوصية
th: ความเป็นส่วนตัว

# about.text
source: مرآة is a mirror for your soul. It helps you build Islamic habits through consistency, reflection, and the science of habit formation. Small deeds done consistently are more beloved to Allah than great deeds done rarely.
ar: مرآة هو مرآة لروحك. يساعدك على بناء عادات إسلامية من خلال الاتساق والتأمل وعلم تكوين العادات. الأعمال الصغيرة المستمرة أحب إلى الله من الأعمال الكبيرة النادرة.
th: มรآة คือกระจกส่องวิญญาณของคุณ ช่วยสร้างนิสัยอิสลามผ่านความสม่ำเสมอ การไตร่ตรอง และวิทยาศาสตร์การสร้างนิสัย ความดีเล็กน้อยที่ทำสม่ำเสมอเป็นที่รักของอัลลอฮ์มากกว่าความดีใหญ่ที่ทำนานๆ ครั้ง

# about.title
source: ABOUT
ar: حول التطبيق
th: เกี่ยวกับ

source: Add a past deed
ar: أضف عملاً فائتاً
th: เพิ่มความดีที่ผ่านมา

source: App Language
ar: لغة التطبيق
th: ภาษาของแอป

source: Begin
ar: ابدأ
th: เริ่มต้น

source: Build Islamic habits, one deed at a time.
ar: ابنِ عادات إسلامية، عملاً واحداً في كل مرة.
th: สร้างนิสัยอิสลาม, ทีละหนึ่งความดี.

source: Cancel
ar: إلغاء
th: ยกเลิก

source: Choose your language
ar: اختر لغتك
th: เลือกภาษาของคุณ

source: Continue
ar: متابعة
th: ดำเนินการต่อ

source: DATA
ar: البيانات
th: ข้อมูล

source: Delete
ar: حذف
th: ลบ

source: Erase all data
ar: مسح جميع البيانات
th: ลบข้อมูลทั้งหมด

# focus.grace.left
source: grace day left
ar: يوم سماح متبقٍّ
th: วันผ่อนผันเหลืออยู่

# focus.picker.selected
source: of 3 selected
ar: من ٣ مختار
th: จาก 3 ที่เลือก

# focus.picker.subtitle
source: Pick up to 3 deeds to focus on building as habits
ar: اختر حتى ٣ أعمال تريد بناءها كعادة
th: เลือกสูงสุด 3 งานที่ต้องการสร้างเป็นนิสัย

# focus.picker.title
source: Focus Deeds
ar: الأعمال المحورية
th: งานสำคัญ

# focus.streak.broken
source: Streak broken — keep going
ar: انقطع التسلسل — استمر
th: ความต่อเนื่องขาด — สู้ต่อไป

# focus.streak.healthy
source: day streak
ar: أيام متتالية
th: วันติดต่อกัน

# focus.view.empty.button
source: Pick Focus Deeds
ar: اختر أعمالاً تريد بناءها
th: เลือกงานสำคัญ

# focus.view.empty.subtitle
source: Pick up to 3 deeds to track your habit progress
ar: اختر حتى ٣ أعمال لتتبع تقدمك في بناء العادة
th: เลือกสูงสุด 3 งานเพื่อติดตามความก้าวหน้า

# focus.view.empty.title
source: No Focus Deeds Yet
ar: لا أعمال محورية بعد
th: ยังไม่มีงานสำคัญ

# focus.view.title
source: Focus Deeds
ar: الأعمال المختارة للتركيز
th: งานสำคัญ

# general.a_day
source: a day
ar: يومياً
th: ต่อวัน

# general.deed
source: deed
ar: عمل
th: ความดี

# general.deeds
source: deeds
ar: اعمال
th: ความดี

# general.level
source: level
ar: المستوى
th: ระดับ

# general.nologgs
source: No logs yet
ar: لا توجد سجلات بعد
th: ยังไม่มีบันทึก

# general.nologgsMessage
source: Start logging deeds from the home screen
ar: ابدأ بتسجيل الأعمال من الشاشة الرئيسية
th: เริ่มบันทึกความดีจากหน้าหลัก

# greeting.afternoon
source: Good afternoon
ar: مساء الخير
th: สวัสดีตอนบ่าย

# greeting.deeds_logged
source: deeds logged
ar: عمل مسجل
th: บันทึกความดี

# greeting.evening
source: Good evening
ar: مساء الخير
th: สวัสดีตอนเย็น

# greeting.morning
source: Good morning
ar: صباح الخير
th: สวัสดีตอนเช้า

# greeting.night
source: Good night
ar: تصبح على خير
th: ราตรีสวัสดิ์

# greeting.today
source: Today
ar: اليوم
th: วันนี้

# habit.logged_today
source: logged today
ar: عمل مسجل اليوم
th: บันทึกแล้ววันนี้

# habitProgress.almost
source: Almost there
ar: أوشكت على بناء العادة
th: เกือบถึงแล้ว

# habitProgress.begin
source: Begin your journey
ar: ابدأ رحلتك
th: เริ่มต้นการเดินทาง

# habitProgress.established
source: Habit established
ar: العادة راسخة
th: สร้างนิสัยสำเร็จ

# habitProgress.forming
source: Habit forming
ar: العادة تتشكل
th: กำลังสร้างนิสัย

source: I'm ready — %lld deeds a day
ar: أنا مستعد — %lld أعمال يومياً
th: ฉันพร้อมแล้ว — %lld ความดีต่อวัน

# insight.advice.1
source: The Prophet ﷺ said: “Religion is sincere advice.” — Sahih Muslim
ar: قال النبي ﷺ: «الدِّينُ النَّصِيحَةُ». — صحيح مسلم
th: ท่านนบี ﷺ กล่าวว่า: “ศาสนาคือการตักเตือนด้วยความจริงใจ” — เศาะฮีห์มุสลิม

# insight.advice.2
source: Giving sincere advice is a sign of loving الخير for others.
ar: تقديم النصيحة الصادقة علامةٌ على محبة الخير للناس.
th: การให้คำตักเตือนอย่างจริงใจ เป็นสัญญาณของการรักความดีให้แก่ผู้อื่น

# insight.advice.3
source: Advice given gently is more likely to enter the heart.
ar: النصيحة بلطفٍ أقرب إلى القلوب وأبلغ في التأثير.
th: การให้คำแนะนำอย่างอ่อนโยน จะเข้าถึงหัวใจได้ง่ายกว่า และมีผลมากกว่า

# insight.dhikr.1
source: “Verily, in the remembrance of Allah do hearts find rest.” — Surah Ar‑Ra’d 13:28
ar: ﴿أَلَا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ﴾ — سورة الرعد
th: “แท้จริงด้วยการรำลึกถึงอัลลอฮ์ หัวใจจะสงบ” — ซูเราะฮ์อัรเราะอ์ด 13:28

# insight.dhikr.2
source: The Prophet ﷺ said: “SubhanAllah, Alhamdulillah, La ilaha illa Allah, and Allahu Akbar are more beloved than all the sun rises upon.” — Sahih Muslim
ar: قال النبي ﷺ: «لَأَنْ أَقُولَ: سُبْحَانَ اللَّهِ، وَالْحَمْدُ لِلَّهِ، وَلَا إِلَهَ إِلَّا اللَّهُ، وَاللَّهُ أَكْبَرُ أَحَبُّ إِلَيَّ مِمَّا طَلَعَتْ عَلَيْهِ الشَّمْسُ». — صحيح مسلم
th: ท่านนบี ﷺ กล่าวว่า: “ซุบฮานัลลอฮ์ อัลฮัมดุลิลลาห์ ลาอิลาฮะอิลลัลลอฮ์ และอัลลอฮุอักบัร เป็นสิ่งที่รักยิ่งกว่าสิ่งใดที่ดวงอาทิตย์ขึ้นเหนือมัน” — เศาะฮีห์มุสลิม

# insight.dhikr.3
source: Dhikr wipes away sins and raises ranks. — Sahih al‑Bukhari
ar: ذِكْرُ اللَّهِ يُكَفِّرُ الذُّنُوبَ وَيَرْفَعُ الدَّرَجَاتِ — صحيح البخاري
th: การซิกรุลลอฮ์ลบล้างบาปและยกระดับขั้น — เศาะฮีห์อัลบุคอรี

# insight.duaa.1
source: “Call upon Me; I will respond to you.” — Surah Ghafir 40:60
ar: ﴿ادْعُونِي أَسْتَجِبْ لَكُمْ﴾ — سورة غافر
th: “จงวิงวอนต่อข้า แล้วข้าจะตอบรับพวกเจ้า” — ซูเราะฮ์ฆอฟิร

# insight.duaa.2
source: The Prophet ﷺ said: “Dua is worship.” — Jamiʿ at‑Tirmidhi
ar: قال النبي ﷺ: «الدُّعَاءُ هُوَ الْعِبَادَةُ». — جامع الترمذي
th: “การดุอาคือการอิบาดะฮ์” — ญามิอ์ อัต-ติรมิซีย์

# insight.duaa.3
source: No sincere dua is ever lost; Allah answers, delays, or replaces it with something better. — Musnad Ahmad
ar: مَا مِنْ دُعَاءٍ صَادِقٍ إِلَّا وَيُجِيبُ اللَّهُ بِهِ بِإِحْدَى ثَلَاثٍ — مسند أحمد
th: “ไม่มีดุอาอ์ที่จริงใจใดสูญเปล่า อัลลอฮ์จะตอบรับในหนึ่งในสามรูปแบบ” — มุสนัดอะหมัด

# insight.fasting.1
source: The Prophet ﷺ said: “Fasting is a shield.” — Sahih al‑Bukhari
ar: قال النبي ﷺ: «الصِّيَامُ جُنَّةٌ». — صحيح البخاري
th: “การถือศีลอดคือโล่ป้องกัน” — เศาะฮีห์อัลบุคอรี

# insight.fasting.2
source: Allah says: “Fasting is for Me, and I will reward it.” — Sahih Muslim
ar: قال الله تعالى: «الصَّوْمُ لِي وَأَنَا أَجْزِي بِهِ». — صحيح مسلم
th: “การถือศีลอดเป็นของข้า และข้าจะเป็นผู้ตอบแทนมัน” — เศาะฮีห์มุสลิม

# insight.fasting.3
source: Fasting disciplines desires and softens the heart toward Allah.
ar: الصِّيَامُ يُهَذِّبُ الشَّهَوَاتِ وَيُلَيِّنُ الْقَلْبَ لِلَّهِ
th: “การถือศีลอดช่วยขัดเกลากิเลสและทำให้หัวใจอ่อนน้อมต่ออัลลอฮ์”

# insight.feeding.1
source: The Prophet ﷺ said: “Feed the hungry.” — Sahih al‑Bukhari
ar: قال النبي ﷺ: «أَطْعِمُوا الطَّعَامَ». — صحيح البخاري
th: “จงให้อาหารแก่ผู้หิวโหย” — เศาะฮีห์อัลบุคอรี

# insight.good_word.1
source: The Prophet ﷺ said: “A good word is charity.” — Sahih al‑Bukhari
ar: الْكَلِمَةُ الطَّيِّبَةُ صَدَقَةٌ — صحيح البخاري
th: “คำพูดที่ดีคือการบริจาคทาน” — เศาะฮีห์อัลบุคอรี

# insight.hadith.2
source: The Prophet ﷺ said: “May Allah brighten a person who hears my words and conveys them.” — Jamiʿ at‑Tirmidhi
ar: قال النبي ﷺ: «نَضَّرَ اللَّهُ امْرَأً سَمِعَ مَقَالَتِي فَبَلَّغَهَا». — الترمذي
th: “ขออัลลอฮ์ทรงให้ความสดใสแก่ผู้ที่ได้ยินคำพูดของฉันแล้วถ่ายทอดต่อ” — อัต-ติรมิซีย์

# insight.islamic_study.1
source: The Prophet ﷺ said: “Whoever follows a path seeking knowledge, Allah will make a path to Paradise easy for him.” — Sahih Muslim
ar: قال النبي ﷺ: «مَنْ سَلَكَ طَرِيقًا يَلْتَمِسُ فِيهِ عِلْمًا سَهَّلَ اللَّهُ لَهُ طَرِيقًا إِلَى الْجَنَّةِ». — صحيح مسلم
th: “ผู้ใดแสวงหาความรู้ อัลลอฮ์จะทำให้ทางสู่สวรรค์ง่ายแก่เขา” — เศาะฮีห์มุสลิม

# insight.islamic_study.3
source: The angels lower their wings for the seeker of knowledge. — Jamiʿ at‑Tirmidhi
ar: تُخْفِضُ الْمَلَائِكَةُ أَجْنِحَتَهَا لِطَالِبِ الْعِلْمِ — الترمذي
th: “บรรดามลาอิกะฮ์จะกางปีกให้แก่ผู้แสวงหาความรู้” — อัต-ติรมิซีย์

# insight.masjid.1
source: “The mosques of Allah are maintained by those who believe in Allah and the Last Day.” — Surah At‑Tawbah 9:18
ar: ﴿إِنَّمَا يَعْمُرُ مَسَاجِدَ اللَّهِ مَنْ آمَنَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ﴾ — التوبة
th: “แท้จริงผู้ที่ดูแลมัสยิดของอัลลอฮ์คือผู้ศรัทธาต่ออัลลอฮ์และวันอาคิเราะฮ์” — ซูเราะฮ์อัตเตาบะฮ์

# insight.masjid.2
source: Every step to the masjid raises a rank and removes a sin. — Sahih Muslim
ar: قال النبي ﷺ: «مَا مِنْ مُسْلِمٍ يَمْشِي إِلَى الصَّلَاةِ إِلَّا رُفِعَتْ لَهُ دَرَجَةٌ وَحُطَّتْ عَنْهُ خَطِيئَةٌ». — صحيح مسلم
th: “ทุกย่างก้าวไปละหมาดจะถูกยกระดับขั้นและลบล้างบาป” — เศาะฮีห์มุสลิม

# insight.masjid.3
source: “Allah says: In houses which Allah has permitted to be raised and His name to be mentioned in them, there glorify Him therein morning and evening * Men whom neither trade nor sale distracts from the remembrance of Allah and establishing prayer…” - Surah An-Nur
ar: قال الله تعالى: ﴿فِي بُيُوتٍ أَذِنَ اللَّهُ أَنْ تُرْفَعَ وَيُذْكَرَ فِيهَا اسْمُهُ يُسَبِّحُ لَهُ فِيهَا بِالْغُدُوِّ وَالْآصَالِ * رِجَالٌ لَا تُلْهِيهِمْ تِجَارَةٌ وَلَا بَيْعٌ عَنْ ذِكْرِ اللَّهِ وَإِقَامِ الصَّلَاةِ...﴾ — سورة النور
th: อัลลอฮ์ตรัสว่า: “ในบรรดาบ้านทั้งหลายที่อัลลอฮ์ทรงอนุญาตให้ยกย่อง และให้พระนามของพระองค์ถูกกล่าวถึงในนั้น จะมีผู้ที่สดุดีพระองค์ทั้งยามเช้าและยามเย็น * คือบรรดาผู้ชายที่การค้าหรือการขายไม่ทำให้พวกเขาละเลยจากการรำลึกถึงอัลลอฮ์และการดำรงละหมาด…” — ซูเราะฮ์อันนูร

# insight.qiyam.1
source: The Prophet ﷺ said: “The best prayer after the obligatory prayers is the night prayer.” — Sahih Muslim
ar: قال النبي ﷺ: «أَفْضَلُ الصَّلَاةِ بَعْدَ الْفَرِيضَةِ صَلَاةُ اللَّيْلِ». — صحيح مسلم
th: “การละหมาดที่ดีที่สุดหลังฟัรฎู คือการละหมาดกลางคืน” — เศาะฮีห์มุสลิม

# insight.qiyam.2
source: “And those who spend the night prostrating and standing for their Lord.” - Surah Al-Furqan
ar: ﴿وَالَّذِينَ يَبِيتُونَ لِرَبِّهِمْ سُجَّدًا وَقِيَامًا﴾ — سورة الفرقان
th: “และบรรดาผู้ที่ใช้เวลายามค่ำคืนในการสุญูดและยืนละหมาดเพื่อพระเจ้าของพวกเขา” — ซูเราะฮ์อัลฟุรกอน

# insight.qiyam.3
source: Those who pray at night are praised in the Qur’an. — Surah As‑Sajdah 32:16
ar: ﴿كَانُوا قَلِيلًا مِنَ اللَّيْلِ مَا يَهْجَعُونَ﴾ — السجدة
th: ผู้ที่ละหมาดในยามค่ำคืนได้รับการยกย่องในคัมภีร์อัลกุรอาน — ซูเราะฮ์อัสสะญดะฮ์ 32:16

# insight.quran.1
source: “Indeed, this Qur’an guides to that which is most upright.” — Surah Al‑Isra 17:9
ar: ﴿إِنَّ هَٰذَا الْقُرْآنَ يَهْدِي لِلَّتِي هِيَ أَقْوَمُ﴾ — الإسراء
th: “แท้จริงอัลกุรอานนี้ชี้นำสู่ทางที่เที่ยงตรงที่สุด” — ซูเราะฮ์อัลอิสรออ์

# insight.quran.2
source: The Prophet ﷺ said: “The best among you are those who learn the Qur’an and teach it.” — Sahih al‑Bukhari
ar: قال النبي ﷺ: «خَيْرُكُمْ مَنْ تَعَلَّمَ الْقُرْآنَ وَعَلَّمَهُ». — صحيح البخاري
th: ท่านนบี ﷺ กล่าวว่า: “ผู้ที่ดีที่สุดในหมู่พวกท่านคือผู้ที่เรียนรู้อัลกุรอานและสอนมัน” — เศาะฮีห์อัลบุคอรี

# insight.quran.3
source: Reading one letter of the Qur’an brings ten rewards. — Jamiʿ at‑Tirmidhi
ar: بِكُلِّ حَرْفٍ مِنَ الْقُرْآنِ حَسَنَةٌ وَالْحَسَنَةُ بِعَشْرِ أَمْثَالِهَا — الترمذي
th: การอ่านอัลกุรอานหนึ่งตัวอักษรได้รับผลบุญสิบเท่า — ญามิอ์ อัตติรมิซี

# insight.remove_harm.1
source: The Prophet ﷺ said: “Removing harmful things from the road is charity.” — Sahih Muslim
ar: قال النبي ﷺ: «إِمَاطَةُ الأَذَى عَنِ الطَّرِيقِ صَدَقَةٌ». — صحيح مسلم
th: “การเอาสิ่งอันตรายออกจากทางคือการบริจาคทาน” — เศาะฮีห์มุสลิม

# insight.sadaqah.1
source: “Charity does not decrease wealth.” — Sahih Muslim
ar: الصَّدَقَةُ لَا تَنْقُصُ الْمَالَ — صحيح مسلم
th: “การบริจาคไม่ทำให้ทรัพย์ลดลง” — เศาะฮีห์มุสลิม

# insight.sadaqah.2
source: Sadaqah extinguishes sins like water extinguishes fire. — Jamiʿ at‑Tirmidhi
ar: قال النبي ﷺ: «إِنَّ الصَّدَقَةَ تُطْفِئُ الْخَطِيئَةَ كَمَا يُطْفِئُ الْمَاءُ النَّارَ». — جامع الترمذي
th: “ท่านนบี ﷺ กล่าวว่า: การบริจาคทานจะดับบาปเหมือนน้ำดับไฟ” — ญามิอ์ อัต-ติรมิซีย์

# insight.smile.1
source: The Prophet ﷺ said: “Your smile for your brother is charity.” — Jamiʿ at‑Tirmidhi
ar: قال النبي ﷺ: «تَبَسُّمُكَ فِي وَجْهِ أَخِيكَ صَدَقَةٌ». — الترمذي
th: “การยิ้มให้พี่น้องของเจ้าคือการบริจาคทาน” — อัต-ติรมิซีย์

# insight.sunnah.1
source: The Prophet ﷺ said: “Whoever revives my Sunnah has loved me.” — Jamiʿ at‑Tirmidhi
ar: قال النبي ﷺ: «مَنْ أَحْيَا سُنَّتِي فَقَدْ أَحَبَّنِي». — الترمذي
th: “ผู้ที่ฟื้นฟูซุนนะฮ์ของฉัน เขาได้รักฉันแล้ว” — อัต-ติรมิซีย์

# insight.sunnah.3
source: Small Sunnah acts done consistently are beloved to Allah. — Sahih Muslim
ar: إِنَّ أَحَبَّ الأَعْمَالِ إِلَى اللَّهِ أَدْوَمُهَا وَإِنْ قَلَّ — صحيح مسلم
th: การกระทำซุนนะฮ์เล็ก ๆ หากผู้ศรัทธาทำอย่างสม่ำเสมอ จะเป็นสิ่งที่อัลลอฮ์ทรงรักยิ่ง — รายงานโดยเศาะฮีห์มุสลิม

# insight.sunnahSalat.1
source: “Whoever prays 12 voluntary rak‘ahs, Allah builds for him a house in Paradise.” — Sahih Muslim
ar: قال النبي ﷺ: «مَا مِنْ عَبْدٍ يُصَلِّي لِلَّهِ ثِنْتَيْ عَشْرَةَ رَكْعَةً تَطَوُّعًا إِلَّا بَنَى اللَّهُ لَهُ بَيْتًا فِي الْجَنَّةِ». — صحيح مسلم
th: “ผู้ใดละหมาดสุนัต 12 ร็อกอะฮ์ อัลลอฮ์จะสร้างบ้านในสวรรค์ให้เขา” — เศาะฮีห์มุสลิม

# insight.sunnahSalat.2
source: “Two rak‘ahs of Fajr sunnah are better than the world and what it contains.” — Sahih Muslim
ar: قال النبي ﷺ: «رَكْعَتَا الْفَجْرِ خَيْرٌ مِنَ الدُّنْيَا وَمَا فِيهَا». — صحيح مسلم
th: “สุนัตก่อนฟัจญร์ 2 ร็อกอะฮ์ ดีกว่าโลกทั้งใบและสิ่งที่อยู่ในนั้น” — เศาะฮีห์มุสลิม

# insight.sunnahSalat.3
source: “Make part of your prayers in your homes.” — Sahih Muslim
ar: قال النبي ﷺ: «اجْعَلُوا مِنْ صَلَاتِكُمْ فِي بُيُوتِكُمْ». — صحيح مسلم
th: “จงทำการละหมาดบางส่วนในบ้านของพวกเจ้า” — เศาะฮีห์มุสลิม

# insight.visit_sick.1
source: The Prophet ﷺ said: “Whoever visits the sick remains in the gardens of Paradise until he returns.” — Sahih Muslim
ar: قال النبي ﷺ: «مَا مِنْ مُسْلِمٍ يَعُودُ مَرِيضًا إِلَّا كَانَ فِي خُرْفَةِ الْجَنَّةِ». — صحيح مسلم
th: “ไม่มีมุสลิมคนใดไปเยี่ยมผู้ป่วย إلاจะอยู่ในสวนแห่งสวรรค์” — เศาะฮีห์มุสลิม

# insight.water.1
source: The Prophet ﷺ said: “The best charity is giving water to drink.” — Sunan Abu Dawud
ar: قال النبي ﷺ: «أَفْضَلُ الصَّدَقَةِ سَقْيُ الْمَاءِ». — حسن / روايات متعددة
th: “การบริจาคที่ดีที่สุดคือการให้น้ำ” — ความหมายจากหะดีษ

# insight.water.3
source: A man was forgiven by Allah for giving water to a thirsty dog. — Sahih al‑Bukhari
ar: سَقَى رَجُلٌ كَلْبًا فَغَفَرَ اللَّهُ لَهُ — صحيح البخاري
th: “ชายคนหนึ่งให้น้ำสุนัข แล้วอัลลอฮ์ทรงอภัยโทษให้เขา” — เศาะฮีห์อัลบุคอรี

source: Language
ar: اللغة
th: ภาษา

source: LANGUAGE
ar: اللغة
th: ภาษา

source: Log deed
ar: سجّل العمل
th: บันทึกความดี

# milestone.encourage.1
source: The angels witness every deed, no matter how small.
ar: الملائكة تشهد كل عمل مهما صغر.
th: มลาอิกะฮ์เป็นพยานทุกการกระทำ ไม่ว่าจะเล็กน้อยแค่ไหน

# milestone.encourage.2
source: Consistency is the seed of every great habit.
ar: الاستمرارية هي بذرة كل عادة عظيمة.
th: ความสม่ำเสมอคือเมล็ดพันธุ์ของนิสัยที่ยิ่งใหญ่

# milestone.encourage.3
source: You showed up today. That is everything.
ar: لقد حضرت اليوم. هذا كل شيء.
th: คุณมาวันนี้ นั่นคือทุกสิ่ง

# milestone.encourage.4
source: Small deeds done daily move mountains over time.
ar: الأعمال الصغيرة اليومية تحرك الجبال بمرور الوقت.
th: ความดีเล็กน้อยที่ทำทุกวัน จะขยับภูเขาได้เมื่อเวลาผ่านไป

# milestone.encourage.5
source: Allah loves the deed that is consistent, even if small.
ar: الله يحب العمل الدائم وإن قلّ.
th: อัลลอฮ์ทรงรักการกระทำที่สม่ำเสมอ แม้จะเล็กน้อย

# milestone.habit.established
source: Habit established
ar: العادة راسخة
th: นิสัยที่ก่อตัวขึ้น

# milestone.keep.logging
source: Keep logging daily to establish this as a real habit
ar: واصل التسجيل يومياً لترسّخ هذه العادة
th: บันทึกทุกวันเพื่อสร้างนิสัยที่แท้จริง

source: Mirror
ar: مرآة
th: กระจกส่องใจ

# mirror.angels
source: The angels witness your efforts
ar: الملائكة تشهد جهدك
th: มลาอิกะฮ์เป็นพยานความพยายามของคุณ

# mirror.days.to
source: more days to
ar: أيام لبلوغ
th: วันอีกถึง

# mirror.grace.last
source: One grace day left. Don't let it slip.
ar: يوم سماح أخير. لا تفوّته.
th: เหลือวันผ่อนผันสุดท้าย อย่าปล่อยให้หลุด

# mirror.journey.start
source: Start your journey. Every great habit begins with a single step.
ar: ابدأ رحلتك. كل عادة عظيمة تبدأ بخطوة واحدة.
th: เริ่มต้นการเดินทาง นิสัยที่ยิ่งใหญ่เริ่มจากก้าวเดียว

# mirror.lasting
source: You are building something lasting.
ar: أنت تبني شيئاً دائماً.
th: คุณกำลังสร้างสิ่งที่ยั่งยืน

# mirror.not.logged
source: You haven't logged this today.
ar: لم تسجّل هذا العمل اليوم بعد.
th: ยังไม่ได้บันทึกวันนี้

# mirror.pick.focus
source: Pick a focus deed to start building a real habit.
ar: اختر عملاً محورياً لتبني عادة حقيقية.
th: เลือกงานสำคัญเพื่อเริ่มสร้างนิสัยที่แท้จริง

# mirror.streak.broken
source: You missed a few days. Today is a new start.
ar: مضت أيام. اليوم بداية جديدة.
th: ขาดไปหลายวัน วันนี้คือการเริ่มต้นใหม่

source: Not yet
ar: ليس بعد
th: ยังไม่พร้อม

# onboard.focus.subtitle
source: Pick up to 3 deeds to focus on. The app tracks your habit progress, streak, and level for each one. You can change them anytime from the Focus tab.
ar: اختر حتى ٣ أعمال للتركيز عليها. يتتبع التطبيق تقدمك ومستواك في كل منها. يمكنك تغييرها في أي وقت.
th: เลือกสูงสุด 3 งาน แอปจะติดตามความก้าวหน้า สตรีค และระดับของแต่ละงาน เปลี่ยนได้ตลอดเวลา

# onboard.focus.title
source: Focus Deeds
ar: الأعمال المحورية
th: งานสำคัญ

# onboard.gotit
source: Got it
ar: فهمت
th: เข้าใจแล้ว

# onboard.notif.desc
source: Based on your usual log time
ar: بناءا على وقت تسجيلك المعتاد
th: ตามเวลาที่คุณบันทึกเป็นประจำ

# onboard.notif.row1
source: Reminds you at your usual log time
ar: يُذكّرك في وقت تسجيلك المعتاد
th: แจ้งเตือนในเวลาที่คุณมักบันทึก

# onboard.notif.row2
source: Silent if you already logged
ar: صامت إذا سجّلت بالفعل
th: เงียบถ้าบันทึกแล้ว

# onboard.notif.row3
source: One reminder per focus deed
ar: تذكير واحد لكل عمل محوري
th: การแจ้งเตือนหนึ่งครั้งต่องานสำคัญ

# onboard.notif.subtitle
source: مرآة learns when you usually log and sends a gentle reminder if you haven't logged yet. No noise — just a nudge at the right time.
ar: مرآة يتعلم وقت تسجيلك المعتاد ويرسل تذكيراً لطيفاً إن لم تسجّل بعد. بلا ضجيج — فقط في الوقت المناسب.
th: มรآة เรียนรู้เวลาที่คุณมักบันทึก และส่งการแจ้งเตือนอ่อนโยนหากยังไม่ได้บันทึก ไม่รบกวน — แค่เตือนในเวลาที่เหมาะสม

# onboard.notif.title
source: Smart Reminders
ar: تذكيرات ذكية
th: การแจ้งเตือนอัจฉริยะ

# onboard.p2.p2
source: Tap a card each day to log a deed.\nShow up consistently — for yourself, toward Allah.
ar: اضغط على بطاقة كل يوم لتسجيل عمل صالح. واظب باستمرار — من أجل نفسك، وتقربًا إلى الله.
th: แตะการ์ดในแต่ละวันเพื่อบันทึกความดี ทำอย่างสม่ำเสมอ — เพื่อตัวคุณเอง และเพื่ออัลลอฮ์

# onboard.p3.p2
source: Tap any card to log a deed for today
ar: اضغط على أي بطاقة لتسجيل عمل صالح لليوم.
th: แตะการ์ดใดก็ได้เพื่อบันทึกความดีสำหรับวันนี้

# onboard.p3.p3
source: Your consistency is tracked over 66 days
ar: يتم تتبع مدى التزامك على مدار 66 يومًا.
th: ความสม่ำเสมอของคุณจะถูกติดตามตลอด 66 วัน

# onboard.p3.p4
source: When you're consistent, add one more deed a day
ar: أضف عملًا صالحًا واحدًا إضافيًا في اليوم على الاقل
th: เมื่อคุณมีความสม่ำเสมอ ให้เพิ่มความดีอีกหนึ่งอย่างต่อวัน

# onboard.p4.p2
source: days
ar: يوم
th: วัน

# onboard.p4.p3
source: The 66-day habit
ar: عادة الـ66 يومًا
th: นิสัย 66 วัน

# onboard.p4.p4
source: Research shows it takes an average of 66 days of consistent practice to build a lasting habit. Mirror tracks your consistency and reflects your progress — no pressure, no punishment.
ar: تُظهر الأبحاث أن تكوين عادة دائمة يتطلب في المتوسط 66 يومًا من الممارسة المستمرة. يتتبع Mirror مدى التزامك ويعكس تقدمك — بدون ضغط أو عقاب.
th: งานวิจัยแสดงให้เห็นว่าการสร้างนิสัยที่ยั่งยืนต้องอาศัยการฝึกฝนอย่างสม่ำเสมอโดยเฉลี่ย 66 วัน Mirror จะติดตามความสม่ำเสมอของคุณและสะท้อนความก้าวหน้า — ไม่มีแรงกดดัน ไม่มีการลงโทษ

# postlog.deeds.today
source: Deeds Today
ar: عمل صالح اليوم
th: ทำความดีวันนี้

# postlog.dismiss
source: May Allah bless you
ar: بارك الله فيك
th: ขออัลลอฮ์ทรงประทานความจำเริญแก่คุณ

# postlog.last66days
source: Last 66 Days
ar: آخر ٦٦ يوم
th: 66 วันล่าสุด

# postlog.science.disclaimer
source: Science shows habits take an average of 66 days to form. Every deed counts.
ar: تُظهر الدراسات العلمية أن تكوين العادات يستغرق في المتوسط 66 يومًا. كل عمل مهم
th: วิทยาศาสตร์แสดงให้เห็นว่าการสร้างนิสัยใช้เวลาเฉลี่ยประมาณ 66 วัน ทุกการกระทำล้วนมีความสำคัญ

source: Reset All Data
ar: إعادة تعيين جميع البيانات
th: รีเซ็ตข้อมูลทั้งหมด

source: Settings
ar: الإعدادات
th: ตั้งค่า

# settings.delete.message
source: This will erase all data stored on this device. Are you sure?
ar: سيؤدي هذا إلى مسح جميع البيانات المخزنة على هذا الجهاز. هل أنت متأكد؟
th: การดำเนินการนี้จะลบข้อมูลทั้งหมดในอุปกรณ์ คุณแน่ใจหรือไม่?

source: Version
ar: الإصدار
th: เวอร์ชัน

# worship.advice
source: Advice
ar: نصيحة
th: คำแนะนำ

# worship.dhikr
source: Dhikr
ar: ذكر
th: ซิกร์

# worship.duaa
source: Du'a'
ar: دعاء
th: ดุอาอ์

# worship.fasting
source: Fasting
ar: صيام
th: การถือศีลอด

# worship.feeding
source: Feeding
ar: إطعام
th: การให้อาหาร

# worship.good_word
source: Good Word
ar: كلمٌ طيّب
th: คำพูดที่ดี

# worship.hadith
source: Hadith
ar: حديث
th: หะดีษ

# worship.islamic_study
source: Islamic Study
ar: دراسة اسلامية
th: อิสลามศึกษา

# worship.masjid
source: Masjid
ar: مسجد
th: มัสยิด

# worship.other
source: Other
ar: أخرى
th: อื่นๆ

# worship.qiyam
source: Qiyam
ar: قيام
th: กิยาม

# worship.quran
source: Qur'an
ar: قرآن
th: อัลกุรอาน

# worship.remove_harm
source: Harm Removal
ar: إماطة الأذى
th: การขจัดสิ่งกีดขวางและอันตราย

# worship.sadaqah
source: Sadaqah
ar: صدقة
th: ซะดะเกาะฮ์

# worship.smile
source: Smile
ar: إبتسامه
th: การยิ้ม

# worship.sunnah
source: Sunnah
ar: سنّة

# worship.sunnahSalat
source: Sunnah Prayer
ar: صلاة سنّة
th: ซุนนะฮ์ละหมาด

# worship.visit_sick
source: Visit Sick
ar: عيادة مريض
th: การเยี่ยมผู้ป่วย

# worship.water
source: Thirst Quenching
ar: سُقْيَا
th: การดับกระหาย

source: You're ready to take on one more deed a day — whenever you feel ready.
ar: أنت مستعد لإضافة عمل آخر يومياً — متى شئت.
th: คุณพร้อมรับความดีเพิ่มอีกหนึ่งต่อวัน — เมื่อคุณพร้อม

source: You've been showing up consistently.
ar: لقد كنت منتظماً في حضورك.
th: คุณมาอย่างสม่ำเสมอ

# general.deeds.today
source: Good Deeds Today
th: ทำความดีวันนี้

# insight.feeding.2
source: The Prophet ﷺ said: "The best of you are those who feed others." — Narrated by Ahmad
th: ท่านนบี ﷺ กล่าวว่า: "ผู้ที่ดีเลิศที่สุดในหมู่พวกท่าน คือผู้ที่ให้อาหาร (แก่ผู้อื่น)" — บันทึกโดยอะห์หมัด

# insight.feeding.3
source: “The Prophet ﷺ said: Guard yourselves against the Fire even if with half a date (in charity).” — Sahih al-Bukhari & Sahih Muslim
th: “ท่านนบี ﷺ กล่าวว่า: จงปกป้องตัวเองจากไฟนรก แม้เพียงการบริจาคแค่ครึ่งผลอินทผลัม” — เศาะฮีห์อัลบุคอรี และเศาะฮีห์มุสลิม
